In [1]:
import matplotlib.pyplot as plt
import pandas as pd
import os

In [5]:
city_data_to_load = 'Resources/city_data.csv'
ride_data_to_load = 'Resources/ride_data.csv'

In [ ]:
#city_share_data

In [6]:
cdl_df = pd.read_csv(city_data_to_load)
cdl_df.head(10)

            city  driver_count   type
0    Richardfort            38  Urban
1   Williamsstad            59  Urban
2    Port Angela            67  Urban
3     Rodneyfort            34  Urban
4    West Robert            39  Urban
5   West Anthony            70  Urban
6    West Angela            48  Urban
7  Martinezhaven            25  Urban
8      Karenberg            22  Urban
9    Barajasview            26  Urban

In [8]:
cdl_df.count()

city            120
driver_count    120
type            120
dtype: int64

In [10]:
cdl_df.isnull().sum()

city            0
driver_count    0
type            0
dtype: int64

In [11]:
cdl_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [12]:
cdl_df['type'].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [15]:
sum(cdl_df['type']=='Urban')

66

In [16]:
sum(cdl_df['type']=='Rural')

18

In [17]:
sum(cdl_df['type']=='Suburban')

36

In [21]:
cdl_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   city          120 non-null    object
 1   driver_count  120 non-null    int64
 2   type          120 non-null    object
dtypes: int64(1), object(2)
memory usage: 2.9+ KB

In [ ]:
#ride_share_data

In [7]:
rdl_df = pd.read_csv(ride_data_to_load)
rdl_df.head(10)

                 city                 date   fare        ride_id
0  Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2  Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3          Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4          South Jack  2019-03-06 04:28:35  34.58  3908451377344
5        South Latoya  2019-03-11 12:26:48   9.52  1994999424437
6       New Paulville  2019-02-27 11:17:56  43.25   793208410091
7        Simpsonburgh  2019-04-26 00:43:24  35.98   111953927754
8     South Karenland  2019-01-08 03:28:48  35.09  7995623208694
9       North Jasmine  2019-03-09 06:26:29  42.81  5327642267789

In [18]:
rdl_df.count()

city       2375
date       2375
fare       2375
ride_id    2375
dtype: int64

In [19]:
rdl_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [20]:
rdl_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2375 entries, 0 to 2374
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   city     2375 non-null   object
 1   date     2375 non-null   object
 2   fare     2375 non-null   float64
 3   ride_id  2375 non-null   int64
dtypes: float64(1), int64(1), object(2)
memory usage: 74.3+ KB

In [ ]:
# Combind the data into single database

In [ ]:
pybar_data_df = pd.merge(rdl_df, cdf_df, how='left', on=['city.'"city]"